Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--jts_overview.tmx
Source language: en
Languages: ja

source: JTS is an open source library of spatial predicates and functions for processing geometries. It provides a complete, consistent, and robust implementation of fundamental algorithms for processing linear geometry on the 2-dimensional Cartesian plane.
ja: JTS はジオメトリ処理のための空間述語・関数のオープンソースライブラリです。JTS は2次元デカルト平面上の線形ジオメトリ処理のための、完全で、矛盾がなく、ロバスト(堅牢)な基本的アルゴリズムを提供します。

source: JTS includes the "JTS Test Builder" which allows users to run tests and experiment with geometry through an interactive desktop interface. JTS stability is ensured through an extensive test suite.
ja: JTS は "JTS Test Builder" という、インタラクティブなデスクトップインタフェースにより、ユーザにジオメトリを用いたテスト実行、試行を可能にするツールを含んでいます。JTS の安定性は広範なテストスイートにより保証されています。

source: JTS is used by most java based Open Source geospatial applications, and :doc:`geos_overview`, which is a C++ port of JTS, is used by most C based applications. Additional ports are available for C# and JavaScript.
ja: JTS は、大半の Java ベースのオープンソース地理空間アプリケーションで利用されており、JTS の C++ 移植の :doc:`geos_overview` は、大半の C ベースのアプリケーションで利用されています。他の移植は、C# と JavaScript で利用可能です。

source: Core Features
ja: 主な機能

source: Geometry model (point, line, area)
ja: ジオメトリモデル (ポイント、ライン、エリア)

source: Geometry operations (e.g., intersect, union, within, etc.)
ja: ジオメトリ演算 (例: 交差(intersect)、統合(union)、含む(within)など)

source: Precision handling
ja: 精度のハンドリング

source: Geometric constructions
ja: ジオメトリ生成

source: Metric functions (e.g., Cartesian 2D distance, Hausdorff distance)
ja: 距離計測機能 (例: デカルト2D距離, ハウスドルフ距離)

source: Spatial algorithms (e.g. buffer creation, line offsets, line simplification)
ja: 空間アルゴリズム (例: バッファ作成、ラインオフセット、ライン簡素化)

source: Geometric math functions (e.g., angles, distances, etc.)
ja: ジオメトリ算術機能 (例: 角度、距離等)

source: Spatial structures (e.g. Quadtree and R-tree, Delauney triangulation)
ja: 空間構造 (例: 4分木とR木、ドロネー三角形分割)

source: Input/Output (e.g., WKT, GML)
ja: 入力/出力 (例: WKT、GML)

source: High-precision arithmetic
ja: 高精度計算

source: Supported Formats
ja: サポートするフォーマット

source: Well Known Text (WKT) and Well Known Binary (WKB)
ja: Well-Known テキスト (WKT) と Well-Known バイナリ (WKB)

source: Java Swing/AWT writing
ja: Java Swing/AWT 書き込み

source: Implemented Standards
ja: 準拠している標準規格

source: Details
ja: 詳細

source: **Website:** https://projects.eclipse.org/projects/locationtech.jts
ja: **Webサイト:** https://projects.eclipse.org/projects/locationtech.jts

source: **Licence:** LGPL
ja: **ライセンス:** LGPL

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** Java
ja: **API インターフェイス:** Java

source: **Support:** https://sourceforge.net/projects/jts-topo-suite/
ja: **サポート:** https://sourceforge.net/projects/jts-topo-suite/
